#4 არითმეტიკული მოქმედებები 

print(5 + 5)

print(5 - 3)

print(5 * 2)

print(10 / 5)

#5 ორი ტექსტური ერთეულის შეერთება 

print("Nika" + "Mgeladze") #ჩემი სახელი-გვარი მივიღე 

#6 დავუშვათ ძალით შეცდომა

#print(Nika + "15")    #ტერმინალმა მაჩვენა რომ გვაქვს შეცდომა #NameError: name 'Nika' is not defined | print(Nika + "15")

#7 ტერმინალი არის ადგილი სადაც ჩვენ ვიღებთ ჩვენს მიერ დაწერილი კოდის შედეგებს.

#8 ცვლადებს შორის არითმეტიკული მოქმედებები

#1 
name = "nika"
surname = "mgeladze"

print(name + " " + surname)

#2 
age = 19
height = 180

print(age * height)

#9 რა არის String და Integer?

# პითონში String გამოიყენება ტექსტური მონაცემების წარმოსადგენად.
# სტრიქონი არის სიმბოლოების თანმიმდევრობა, 
# რომელიც ჩასმულია ერთ ბრჭყალებში ('') ან ორმაგ ბრჭყალებში (""). 
#Int, ანუ Integer, არის მთელი რიცხვი, დადებითი ან უარყოფითი, ათწილადების გარეშე, შეუზღუდავი სიგრძით. მას არ სჭირდება ბრჭყალები.

